#+TITLE: org-show - simple presentations in org-mode
#+AUTHOR: John Kitchin

There are several options for "presenting" from org-mode. Here are the options I found.

https://github.com/rlister/org-present
https://github.com/eschulte/epresent

https://github.com/yjwen/org-reveal
https://github.com/takaxp/org-tree-slide/
https://github.com/tucasp/org-presie

http://orgmode.org/worg/exporters/beamer/tutorial.html
http://orgmode.org/worg/org-tutorials/non-beamer-presentations.html#sec-3

The one I like the best is discussed here: http://sachachua.com/blog/2013/04/how-to-present-using-org-mode-in-emacs/. I like it best because you can edit the slides as you go, execute arbitrary emacs code, and it is still pretty simple. I used Sacha's code as the basis for org-show. There is a lot of similarity.

elisp:org-show-mode

elisp:org-show-start-slideshow

** Need a more complicated layout?				      :slide:
Write some code to generate it, and put it in an emacs-lisp-slide block. org-show will run it and show you the result

#+BEGIN_SRC emacs-lisp
(delete-other-windows)
(split-window-right)
(other-window 1)
(find-file "taskbar.png")
(split-window-below)
(other-window 1)
(find-file "doi-utils.org")
#+END_SRC

#+RESULTS:
: #<buffer doi-utils.org>

#+BEGIN_EXAMPLE
,#+BEGIN_SRC emacs-lisp-slide
(delete-other-windows)
(split-window-right)
(other-window 1)
(find-file "taskbar.png")
(split-window-below)
(other-window 1)
(find-file "doi-utils.org")
,#+END_SRC
#+END_EXAMPLE

